# SetApplicationGUID Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SchemaBuilder..::..SetApplicationGUID Method
SchemaBuilder Class See Also
---
Sets the GUID of the application or add-in that may access entities of this Schema under the Application acess level.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public SchemaBuilder SetApplicationGUID(
	Guid applicationGUID
)
```

Visual Basic
---
```text
Public Function SetApplicationGUID ( _
	applicationGUID As Guid _
) As SchemaBuilder
```

Visual C++
---
```text
public:
SchemaBuilder^ SetApplicationGUID(
	Guid applicationGUID
)
```

# ### Parameters
applicationGUID
    Type: System..::..Guid The application id.
# ### Return Value
The SchemaBuilder object may be used to add more settings.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The SchemaBuilder has already finished building the Schema. |

# See Also
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace